app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
	def index
		binding.pry
		@posts = Post.all

INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Rails Introduction Quiz"], ["description", "asdfasdf"], ["created_at", "2015-12-31 19:45:03.614973"], ["updated_at", "2015-12-31 19:45:03.614973"]]
---
	def create
	  @post = Post.new
	#   @post.new(params.require(:post).permit(:title, :description))
	  @post.title = params[:title]
	  @post.description = params[:description]
	  @post.save